[
  {
    "title": "Getting Started",
    "desc": "Network Scale Compute (NSC) platform is a shared,\n        distributed and managed compute and data storage environment for deploying containerized applications in an enterprise.",
    "img": "11.jpg",
    "date": "Sep 06, 2018",
    "author": "Roshith CK",
    "tag": "Get Started with NSC",
    "id": "getting_started"
  },
  {
    "title": "Its all about Ecosystem",
    "desc": "In the world of Big Data, Hadoop has ruled for a decade. Recently, Hadoop 3 was released,\n        but in reality, we believe the world has largely moved to Kubernetes.",
    "img": "1.jpg",
    "date": "Sep 06, 2018",
    "author": "Håkan Sessle",
    "tag": "Moving to modern Kubernetes platform",
    "id": "ecosystem"
  },
  {
    "title": "Identity Management and AD Integration of NSC Platform",
    "desc": "Access control and authentication are essential for every system or group of systems/services,\n        but does it always have to be tiresome for users? There are ways to manage access control and authentication",
    "img": "background-image.png",
    "date": "Sep 14, 2018",
    "author": "Sanjay Bardhan",
    "tag": "Identity Management",
    "id": "identity_management"
  },
  {
    "title": "My first manifest on NSC",
    "desc": "NSC enables you to use a custom service that you think is appropriate for your needs.\n        To use a custom service in NSC, you will require multiple resources such as deployment and service.",
    "img": "background-image.png",
    "date": "Sept 14, 2018",
    "author": "Roshith CK",
    "tag": "Manifest",
    "id": "first_manifest"
  },
  {
    "title": "Helm Chart: Kubernetes Package Manager",
    "desc": "In the current decade, most of the companies have a vast majority of \n        their applications hosted on containers rather than physical servers. \n        This is because containers offer numerous advantages with respect to system management, scalability and flexibility. \n        Helm charts complement containers in several ways.",
    "img": "background.jpg",
    "date": "Oct 6, 2018",
    "author": "Prathyusha Seelam P",
    "tag": "Helm",
    "id": "helm_kuberentes_package_manager"
  },
  {
    "title": "Apache Drill",
    "desc": "This blog talks about what is Apache Drill,\n        how to launch a Drill cluster on the NSC platform and how to use it to query your data.",
    "img": "background.jpg",
    "date": "Oct 6, 2018",
    "author": "Tilak Surneni",
    "tag": "Query with Drill",
    "id": "apache_drill"
  },
  {
    "title": "How to use Helm in NSC",
    "desc": "In NSC, Helm can be used to add a custom service. \n        The fact that NSC allows you to use a custom service is one of the USPs of NSC. \n        Let us now go ahead and use Helm in NSC.",
    "img": "11.jpg",
    "date": "Nov 11, 2018",
    "author": "Prathyusha Seelam P",
    "tag": "Helm",
    "id": "how_to_use_helm"
  },
  {
    "title": "Where did my data go?",
    "desc": "Did you recently say, “Oh no! Not these messages again!” or “What is this?”\n        We hear you.",
    "img": "background-image.png",
    "date": "Dec 01, 2018",
    "author": "Anusha Srinivasan",
    "tag": "MAPR",
    "id": "where_did_my_data_go"
  },
  {
    "title": "What I need is \"my\" service",
    "desc": "NSC offers you a service catalog of several popular data analytic services.\n        But what about if you don’t find the service you want on the list?",
    "img": "background-image.png",
    "date": "Dec 15, 2018",
    "author": "Anusha Srinivasan",
    "tag": "Custom Service ",
    "id": "what_i_need_is_my_service"
  },
  {
    "title": "NSC adds CLI support for Helm Chart management",
    "desc": "Are you a fan of Helm Charts? Are you comfortable deploying them for your applications?\n        Then, we have good news for you!",
    "img": "background.jpg",
    "date": "Jan 5, 2019",
    "author": "Anusha Srinivasan",
    "tag": "Helm",
    "id": "cli_support_for_helm"
  },
  {
    "title": "Apache Beam with Flink_V0.4",
    "desc": "If you have used Apache Beam for your data processing,\n         then you will most likely expect NSC to have it too. In this blog,\n          we will tell you how to use Apache Beam in the NSC platform, with Apache Flink Runner.",
    "img": "11.jpg",
    "date": "Feb 02, 2019",
    "author": "Ganesh Banda",
    "tag": "Service Catalogue",
    "id": "apache_beam_with_flink"
  },
  {
    "title": "NSC makes it \"real-time\" with Apache NiFi",
    "desc": "\"Real-time\" is a much-used \"buzzword\" in many industries,\n         but the data analytics industry pretty much defined the term.\n          Real-time processing, where digital data is stored, processed, analyzed",
    "img": "background-image.png",
    "date": "Feb 02, 2019",
    "author": "Anusha Srinivasan",
    "tag": "Service Catalogue",
    "id": "apache_nifi"
  },
  {
    "title": "Onboarding NSC Users",
    "desc": "This blog will help you understand how we can quickly onboard you, or your team, to NSC. Welcome!\n        Before we get into the steps, some prerequisites ...\n        You need to have a valid SIGNUM and password.\n        The onboarding process involves four steps as shown below.",
    "img": "11.jpg",
    "date": "Mar 16, 2019",
    "author": "Anusha Srinivasan",
    "tag": "NSC",
    "id": "onboarding_nsc_users"
  },
  {
    "title": "Let your data flow using StreamSets",
    "desc": "Gone are the days when you had to remember several schemas and codes to\n         efficiently manage data operations. You can now make your data consumption-ready,\n          for all your analytical activities, using the  StreamSets Data Collector (SDC): a data operations platform.",
    "img": "background-image.png",
    "date": "Mar 16, 2019",
    "author": "Anusha Srinivasan",
    "tag": "Service Catalogue",
    "id": "let_your_data_flow_using_streamsets"
  },
  {
    "title": "Freedom to use multiple volumes for custom services",
    "desc": "Until now, the following volume-related restriction has been in force:\n        'Every NSC service deployment is associated with just one volume.\n        You can choose the desired volume among the ones available for your group...'\n        ",
    "img": "11.jpg",
    "date": "Mar 16, 2019",
    "author": "Anitha Mulcha",
    "tag": "MAPR",
    "id": "multiple_volumes_for_custom_services"
  },
  {
    "title": "A 'must read' for AI/ML strategic planners",
    "desc": "We all know that\n AI is essential to every large company’s future business, but how to source and\n establish the necessary infrastructure and resources, and how to structure a\n company to integrate AI are fundamental and vitally important questions. ",
    "img": "background-image.png",
    "date": "Mar 31, 2019",
    "author": "Graham Stanhope ",
    "tag": "AI",
    "id": "must_read_ai_ml_strategic_planners"
  },
  {
    "title": "Where do I go for help?",
    "desc": "You’ve got a new\n  gadget that is going to make your life easier. The gadget’s new to the market, you’re\n  inexperienced, you may experience some problems; you need some help.\n  You may be in a similar situation with Network Scale Compute (NSC) too. NSC\n  will make your analytics jobs easy, but you may need help at times.",
    "img": "11.jpg",
    "date": "Mar 31, 2019",
    "author": "Anusha Srinivasan",
    "tag": "Help",
    "id": "where_do_i_go_for_help"
  },
  {
    "id":"cost_comparison",
    "title":"Cost comparison for NSC services",
    "desc": "Ericsson Network\nScale Compute (NSC) has matured from an experimental system into a fully capable\nand proven commercial offering. While it was once available for free internal\nuse, it is now a charged service based primarily upon two services...",
    "author": "Graham Stanhope",
    "date": "Apr 07, 2019",
    "img":  "background-image.png",
    "tag": "NSC"
  }
]
